{
  "backend/main.mo": "Empty Motoko actor definition placeholder.",
  "feature_evidence.json": "Feature evidence report linking the hero photo removal feature to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of main frontend files and components.",
  "frontend/index.css": "Tailwind base setup defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML shell mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "App component that renders CongratsPage.",
  "frontend/src/components/CongratsPage.tsx": "Composes the hero, highlights, aircraft photo sections, and footer inside ThemeShell.",
  "frontend/src/components/Footer.tsx": "Footer with copyright text and caffeine.ai link.",
  "frontend/src/components/sections/AircraftPhotoSection.tsx": "Section displaying a styled aircraft photo with header and caption.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with congratulatory text and Boeing 737 and Air India Express info.",
  "frontend/src/components/sections/HighlightsSection.tsx": "Interactive highlights grid where each item opens a surprise modal.",
  "frontend/src/components/SurpriseModal.tsx": "Reusable modal showing an image and message using shadcn dialog components.",
  "frontend/src/components/ThemeShell.tsx": "Layout wrapper applying repeating airplane-pattern background.",
  "frontend/src/hooks/useActor.ts": "Hook creating and updating a backend actor based on Internet Identity authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login state and AuthClient lifecycle.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive OKLCH color variables for light/dark themes and applies base typography and layout styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers and loading global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color tokens, animations, typography, container settings, and plugins.",
  "project_state.json": "Stores project metadata, feature definitions, known issues, and configuration for the themed congratulatory website."
}